line1 = ['莘庄', '外环路', '莲花路', '锦江乐园', '上海南站', '漕宝路', '上海体育馆', '徐家汇', '衡山路', '常熟路',
         '陕西南路', '黄陂南路', '人民广场', '新闸路', '汉中路', '上海火车站', '中山北路', '延长路', '上海马戏城',
         '汶水路', '彭浦新村', '共康路', '通河新村', '呼兰路', '共富新村', '宝安公路', '友谊西路', '富锦路']
line2 = ['浦东国际机场', '海天三路', '远东大道', '凌空路', '川沙', '华夏东路', '创新中路', '唐镇', '广兰路', '金科路',
         '张江高科', '龙阳路', '世纪公园', '上海科技馆', '世纪大道', '东昌路', '陆家嘴', '南京东路', '人民广场',
         '南京西路', '静安寺', '江苏路', '中山公园', '娄山关路', '威宁路', '北新泾', '淞虹路', '虹桥2号航站楼站',
         '虹桥火车站', '徐泾东']

beg = line1.index('上海南站')
end = line2.index('金科路')
flag = 0
for i in range(beg, len(line1)):
    if line1[i] in line2:
        print("在" + line1[i] + "换乘2号线")

        for j in range(29, 0, -1):
            if line2[j] == line1[i]:
                flag = 1
            if flag == 1:
                print("二号线：" + line2[j])
            if j == end:
                break

    else:
        if flag == 0:
            print("一号线：" + line1[i])
